public class Main {

    /**
     * implementations for questions at https://habr.com/ru/post/422259/
     * @param args
     */
    public static void main(String[] args) {
        System.out.println("Module2");

        //1. Объединить два отсортированных массива

        //2. Реверс строки с помощью стека

        //3. Реверс первых N элементов очереди

        //4. Определение цикла в связанном списке

        //5. Посчитать количество ребер (дуг) в графе

        //6. Найти предков N узла в двоичном дереве

        //7. Вывести все слова Trie ( префиксное деревое )

        //8. Найти симметричные пары в массиве
    }
}
